# FtSup2PerFt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..FtSup2PerFt Property
SymbolTypeId Class See Also
---
Symbol ft²/ft, indicating unit Square feet per foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId FtSup2PerFt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FtSup2PerFt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FtSup2PerFt {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace